<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class JobTypeSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('job_types')->insert(
            [
                ['name' => 'باحث ثالث تنمية ادارية', 'slug' => 'باحث-ثالث-تنمية-ادارية'],
                ['name' => 'درجه كتابية', 'slug' => 'درجه-كتابية'],
                ['name' => 'التخصصات الفنية', 'slug' => 'التخصصات-الفنية'],
                ['name' => 'التخصصات الهندسية', 'slug' => 'التخصصات-الهندسية'],
                ['name' => 'التخصصات الطبية', 'slug' => 'التخصصات-الطبية'],
                ['name' => 'التخصصات التربوية', 'slug' => 'التخصصات-التربوية'],
                ['name' => 'التخصصات القانونية', 'slug' => 'التخصصات-القانونية'],
                ['name' => 'التخصصات المالية', 'slug' => 'التخصصات-المالية'],
                ['name' => 'التخصصات الادارية', 'slug' => 'التخصصات-الادارية'],
                ['name' => 'التخصصات الاجتماعية', 'slug' => 'التخصصات-الاجتماعية'],
                ['name' => 'التخصصات الزراعية', 'slug' => 'التخصصات-الزراعية'],
                ['name' => 'التخصصات البيئية', 'slug' => 'التخصصات-البيئية'],
                ['name' => 'التخصصات الاقتصادية', 'slug' => 'التخصصات-الاقتصادية'],
                ['name' => 'التخصصات السياحية', 'slug' => 'التخصصات-السياحية'],
                ['name' => 'التخصصات الثقافية', 'slug' => 'التخصصات-الثقافية'],
                ['name' => 'التخصصات الرياضية', 'slug' => 'التخصصات-الرياضية'],
                ['name' => 'التخصصات الفنية التشكيلية', 'slug' => 'التخصصات-الفنية-التشكيلية'],
                ['name' => 'التخصصات الفنية الموسيقية', 'slug' => 'التخصصات-الفنية-الموسيقية'],
                ['name' => 'التخصصات الفنية المسرحية', 'slug' => 'التخصصات-الفنية-المسرحية'],
                ['name' => 'التخصصات الفنية السينمائية', 'slug' => 'التخصصات-الفنية-السينمائية'],
                ['name' => 'التخصصات الفنية الاعلامية', 'slug' => 'التخصصات-الفنية-الاعلامية'],
                ['name' => 'التخصصات الفنية الحرفية', 'slug' => 'التخصصات-الفنية-الحرفية'],
                ['name' => 'التخصصات الفنية التكنولوجية', 'slug' => 'التخصصات-الفنية-التكنولوجية'],
                ['name' => 'التخصصات الفنية المعلوماتية', 'slug' => 'التخصصات-الفنية-المعلوماتية'],
                ['name' => 'التخصصات الفنية الزراعية', 'slug' => 'التخصصات-الفنية-الزراعية'],
                ['name' => 'التخصصات الفنية البيئية', 'slug' => 'التخصصات-الفنية-البيئية'],
                ['name' => 'التخصصات الفنية الاقتصادية', 'slug' => 'التخصصات-الفنية-الاقتصادية'],
                ['name' => 'التخصصات الفنية السياحية', 'slug' => 'التخصصات-الفنية-السياحية'],
                ['name' => 'التخصصات الفنية الثقافية', 'slug' => 'التخصصات-الفنية-الثقافية'],
                ['name' => 'التخصصات الفنية الرياضية', 'slug' => 'التخصصات-الفنية-الرياضية'],
                ['name' => 'التخصصات الفنية التشكيلية', 'slug' => 'التخصصات-الفنية-التشكيلية'],
                ['name' => 'التخصصات الفنية الموسيقية', 'slug' => 'التخصصات-الفنية-الموسيقية'],
                ['name' => 'التخصصات الفنية المسرحية', 'slug' => 'التخصصات-الفنية-المسرحية'],
                ['name' => 'التخصصات الفنية السينمائية', 'slug' => 'التخصصات-الفنية-السينمائية'],
                ['name' => 'التخصصات الفنية الاعلامية', 'slug' => 'التخصصات-الفنية-الاعلامية'],
                ['name' => 'التخصصات الفنية الحرفية', 'slug' => 'التخصصات-الفنية-الحرفية'],
                ['name' => 'التخصصات الفنية التكنولوجية', 'slug' => 'التخصصات-الفنية-التكنولوجية'],
                ['name' => 'التخصصات الفنية المعلوماتية', 'slug' => 'التخصصات-الفنية-المعلوماتية'],
                ['name' => 'التخصصات الفنية الزراعية', 'slug' => 'التخصصات-الفنية-الزراعية'],
                ['name' => 'التخصصات الفنية البيئية', 'slug' => 'التخصصات-الفنية-البيئية'],
                ['name' => 'التخصصات الفنية الاقتصادية', 'slug' => 'التخصصات-الفنية-الاقتصادية'],
                ['name' => 'التخصصات الفنية السياحية', 'slug' => 'التخصصات-الفنية-السياحية'],
                ['name' => 'التخصصات الفنية الثقافية', 'slug' => 'التخصصات-الفنية-الثقافية'],
                ['name' => 'الخدمات المعاونة', 'slug' => 'الخدمات-المعاونة'],
                ['name' => 'وظائف القيادة العليا', 'slug' => 'وظائف-القيادة-العليا'],
                ['name' => 'وظائف الخدمات الصحية', 'slug' => 'وظائف الخدمات-الصحية'],



            ]
        );
    }
}